#include <stdio.h>
#include <time.h>
#include "AssemblyOperations.h"
#include "AssemblyReader.h"
#include "execution.h"

int main(int argc, char *argv[]) {
	// initialize the rest of the stack
	// prepare exerything for the execution
	instruction_counter = 0;
    
    int num_qubits;
    int run;
    if (argc > 2) {
        num_qubits = (int) strtol(argv[1], NULL, 10);
        run = (int) strtol(argv[2], NULL, 10);
    }
    else {
        num_qubits = 64;
        run = 1;
    }
	clock_t t1 = clock();

	sequence_t  *seq;
	clock_t t2 = clock();

	if (run) {
		QPU_state = instruction_list;
        QPU_state->R0 = malloc(sizeof(int));
        *QPU_state->R0 = 3;
        
        seq = qq_or_seq();
		
        // ._execute
		circuit_t *circ = init_circuit();
//        printf("%d\n", INTEGERSIZE);
		qubit_t qubit_array[6 * INTEGERSIZE];
		qubit_mapping(qubit_array, circ);
        run_instruction(seq, qubit_array, true, circ);
		print_circuit(circ);
        
		printf("%f\n", (double) (clock() - t1) / CLOCKS_PER_SEC);
	}else{
		printf("%f\n", (double) (t2 - t1) / CLOCKS_PER_SEC);
	}
 

	free(seq);

	return 0;
}


//0 H─┊P 1.6─┊──P 0.8─┊──────P 0.4─┊────────P-1.2─┊────────────┊────────┊──────┊──┊──────┊────────┊──────P-0.4─┊──P-0.8─┊P-1.6─┊H─┊
//1 ──┊@─────┊H─│─────┊P 1.6─│─────┊──P 0.8───────┊──────P-2.4─┊────────┊──────┊──┊──────┊──P-0.8─┊P-1.6─│─────┊H─│─────┊@─────┊──┊
//2 ──┊──────┊──@─────┊@─────│─────┊H─│───────────┊P 1.6───────┊──P-4.7─┊──────┊──┊P-1.6─┊H─│─────┊@─────│─────┊──@─────┊──────┊──┊
//3 ──┊──────┊────────┊──────@─────┊──@───────────┊@───────────┊H───────┊P-3.1─┊H─┊@─────┊──@─────┊──────@─────┊────────┊──────┊──┊
